{"pageProps":{"frontmatter":"{\"title\":\"Coding Convention - Qui ước mã hóa\",\"date\":\"2019-07-05T10:15:40.000Z\",\"status\":\"publish\",\"thumbnail\":\"images/post-thumbnail/array-khong-chi-la-array.png\",\"description\":\"Để viết bài này mình sẽ đi theo định nghĩa \\\"What is coding convention\\\" của thầy Ân Nguyễn, còn lại là những chia sẽ suy nghĩ của cá nhân mình, nên sẽ không khỏi thiếu sót và cần bổ sung từ thầy cô và các bạn.\",\"tags\":[\"soft-skills\"]}","content":"\nĐể viết bài này mình sẽ đi theo định nghĩa \"What is coding convention\" của thầy Ân Nguyễn, còn lại là những chia sẽ suy nghĩ của cá nhân mình, nên sẽ không khỏi thiếu sót và cần bổ sung từ thầy cô và các bạn.\n\nCoding convention bao gồm những phần: file organization, indentation, comments, declarations, statements, white space, naming conventions, programming practices, programming principles,...quá nhiều cho một post cho nên mình sẽ trọng tâm vào những cái thường gặp.\n\nWhy do we need to follow the coding convention?\n\n- Làm cho code dễ đọc hơn.\n- Chuyên nghiệp.\n- Mã nguồn dễ bảo trì chỉnh sửa hơn.\n- Tạo sự tôn trọng dành cho người đến sau.\n\n## 1. FILE ORGANIZATION\n\nViệc tổ chức file này rất quan trọng và theo mình nó được coi là cột sống của dự án, những việc này thường được những người có kinh nghiệm đảm nhiệm. Các thư mục được tổ chức phân theo từng chức năng như: route, components, container, assets,...\n\nĐối với những dự án vừa và nhỏ người ta thường chia dự án theo MVC tức model, view, controller, với những dự án lớn người ta sẽ có cách chia khác nhau nữa là chia theo từng chức năng của hệ thống để dễ dàng chỉnh sửa như: post, payment, product...\n\nNhững cài đặt liên quan đến triển khai hệ thống: docker, webpack,.. phân chia môi trường: development, staging, production, cài đặt database,... Để hiểu và làm được những thứ này bạn đã đủ lên trình senior rồi\n\n## 2. COMMENT\n\nĐối với lập trình mà nói việc code mà không để lại comment là trash code nhất là đối với những bạn làm BE, những xử lý logic phức tạp bạn phải loay hoay cả buổi mà không biết mình đang làm gì vì lỡ quay sang thằng bạn kế bên, điều này thật kinh khủng, Thói quen comment trước khi làm là một kỹ năng và kỹ năng đó sẽ mang lại nhiều lợi ích hơn bạn tưởng\n\n```javascript\n// Feature:\ncallAPI function callAPI(){\n   // List what you handler here\n   iUsingThisPackageToGetAPI();\n   // It is better when comment each line\n}\n```\n\nVà một cảnh giới của giới lập trình là: **Good code is self-documenting** nghĩa là không cần comment người khác nhìn vào cũng biết code mình làm gì, mình ghét nhất code kiểu đánh đố nhau, cực kỳ ghét.\n\n## 3. INDENTATION\n\nLuôn thục đầu dòng 1 tab trước cha mẹ của nó cũng như học sinh phải biết lễ phép với thầy cô, điều này giúp code sáng sủa hơn nhìn vào phát là kết ngay và quan trọng hơn tính chất này còn là sự bắt buộc ở những ngôn ngữ dạng Hyper text như Jade/Pug (thử đi để thấy độ khó chịu).\n\n[Pug](https://pugjs.org/api/getting-started.html).\n\n_Ex1: Bad practice_\n\n```javascript\nfunction IAmYourFather() {\n  //the children say\n  noIAmYourChildrenOK();\n}\n```\n\n_Ex2: Good practice_\n\n```javascript\nfunction IAmYourFather() {\n  // the children say\n  YesDaddy();\n}\n```\n\n## 4. DECLARATIONS\n\nViệc khai báo biến thì phải khai báo ngay ở đầu file, khai báo thuộc tính phải ở sau tên class Đối với những ngôn ngữ lập trình cho phép khai báo tên hàm thì hãy làm điều đó trước khi định nghĩa hàm để khi lướt qua ta có thể biết nó có những hàm nào, định nghĩa ra sao, input, output...\n\n```javascript\n// Find max number\nint max(int a, int b);\n\nint max(int a, int b){\n  // define here\n}\n```\n\n## 5. NAMING CONVENTIONS\n\nHiện nay ta có một số qui ước để đặt tên cho biến, hàm tuy nhiên nó sẽ được điều chỉnh linh hoạt trong khi làm việc nhóm, nhưng thông thường sẽ như thế này:\n\n1. Tên Biến sẽ dùng chữ in thường, gạch dưới \"\\_\" giữa những chữ in thường: `int firstname = \"Kane\"`\n2. Tên Hằng sẽ dùng chữ in hoa toàn bộ: `const KANEBLOG = \"https://kanetu.github.io/\"`\n3. Tên Hàm/Method sẽ viết theo kiểu Camel (lạc đà): `myFunction()`\n4. Tên Class viết theo kiểu StudlyCaps (Pascal Case), in hoa mỗi chữ cái đầu: `class PaymentVnpay{}`\n\nHãy dành thời gian để xem cái này để hiểu gõ hơn:\n[Qui tắt đặt tên biến - Code style (PHP code style, Database naming convention. Mastering Git - {Be} Solution)](http://bit.ly/2mA3crH).\ntags:\n\n## 6 FORMAT CODE TOOL\n\nNếu bạn đang code JavaScript hãy sử dụng ESLint trên VSCode nó sẽ giúp bạn format lại code theo đúng chuẩn ES6\n"},"__N_SSG":true}