{"pageProps":{"frontmatter":"{\"title\":\"Ngày đầu thực tập tại {Be} Solution\",\"date\":\"2018-06-04T10:32:40.000Z\",\"status\":\"draft\",\"thumbnail\":\"images/post-thumbnail/array-khong-chi-la-array.png\",\"description\":\"Xin chào, tôi là Hiếu nickname là Kane hiện đang là sinh viên năm 3 trường đại học Trà Vinh, năm 3 này tôi được đi thực tập tại một cty outsource ở TP HCM là Be Solutions, ở đây tôi được rất nhiều người hướng dẫn tùy vào từng giai đoạn thực tập, người hướng dẫn tôi anh Yang Nguyễn đặt ra 3 yêu cầu phải làm trong khóa thực tập này bao gồm:\",\"tags\":[\"diary\"]}","content":"\nXin chào, tôi là Hiếu nickname là Kane hiện đang là sinh viên năm 3 trường đại học Trà Vinh, năm 3 này tôi được đi thực tập tại một cty outsource ở TP HCM là Be Solutions, ở đây tôi được rất nhiều người hướng dẫn tùy vào từng giai đoạn thực tập, người hướng dẫn tôi anh Yang Nguyễn đặt ra 3 yêu cầu phải làm trong khóa thực tập này bao gồm:\n\n1. Bootstrap 3 or 4 (bao gồm jQuery)\n2. Yii 2\n3. Một số CMS lớn\n\nChúng tôi gồm 3 người @Eric @Groot và tôi, lúc đầu cả 3 đều rất bỡ ngở vì cũng là lần đầu lên Sài Gòn mọi thứ đều mới mẽ và nhiều lúc tôi cảm thấy bị nghẹt thở vì cái nhộn nhịp của cái trốn này.\nChúng tôi được hướng dẫn đến một nơi tại địa chỉ: International Plaza 343 Pham Ngu Lao, Pham Ngu Lao Ward, District 1, Ho Chi Minh city, Vietnam.\n\nChúng tôi đến rất sớm và phải chờ khoảng 15 phút vì cty bắt đầu làm việc từ lúc 8h30, vào văn phòng tôi được một chị bên HR là chị Mary Vu hướng giới thiệu một số thông tin cũng như người hướng dẫn thực tập ở đây, tôi và Eric được anh Yang Nguyen hướng dẫn còn Groot thì tôi không gõ vì nó làm bên .Net còn tôi và Eric làm bên PHP.\n\nĐiều tôi thích nhất ở đây là môi trường làm việc rất năng động, những nhân viên ở đây đều hòa đồng vui vẻ nhất là bên team chúng tôi (PHP). Công việc đầu tiên của tôi là làm một trang html tĩnh nhưng phải làm theo những gì đã được design từ trước, chúng tôi phải sử dụng photoshop để cắt và đo đúng kích thước, công việc này yêu cầu phải làm trang web hoạt động trên mọi thiết bị hay còn gọi là responsive.\n\nPhần tôi thích nhất trong job này là code javascript tự động cộng dồn item khi responsive, nó khá hay và hấp dẫn.\n\n5h30 chúng tôi kết thúc buổi làm việc và ra về.\n"},"__N_SSG":true}