{"pageProps":{"frontmatter":"{\"title\":\"Suy nghĩa của một thằng Intern\",\"date\":\"2018-07-13T12:32:40.000Z\",\"status\":\"draft\",\"thumbnail\":\"images/post-thumbnail/array-khong-chi-la-array.png\",\"description\":\"Hôm này là một ngày buồn chán, tôi đã hoàn thành xong khóa trainning của mình và giờ khá là rãnh để ngồi viết những dòng này. Người ta nói \\\"Ngựa non háu đá\\\" và đó chính là tôi bây giờ.\",\"tags\":[\"diary\"]}","content":"\nHôm này là một ngày buồn chán, tôi đã hoàn thành xong khóa trainning của mình và giờ khá là rãnh để ngồi viết những dòng này. Người ta nói \"Ngựa non háu đá\" và đó chính là tôi bây giờ.\n\nỞ {Be} cũng rất vui mọi người hòa đồng với nhau, nhưng ở đây tôi không thực sự yêu thích công việc này hoặc có lẻ tôi đang dành trọn tình yêu của mình cho `javascript` vì nó rất powerful, nhất là nó rất có nhiều framework: ReactJS, AngularJS, VueJS..\nvà hơn nữa là Nodejs người ta dùng Nodejs để tạo server, bây giờ javascript không chỉ còn là một ngôn ngữ lập trình client-side nữa, nó nổi lên như một làng sóng công nghệ và khi nắm trong tay javascript thì như nắm hầu hết công nghệ web tiên tiến hiện nay (theo tôi nghĩ là vậy).\n\nTôi bắt đầu suy nghĩ nên đi hay ở lại {Be} sau khi hoàn thành khóa thực tập này, tôi không chắc công ty có tuyển tôi cho vị trí fresher hay không và chắc gì tôi được nhận khi rời khỏi {Be}, lúc này trong lòng tôi đang rối bời bởi không biết mình nên phải làm gì,\n\nNên mở lối đi cho riêng mình để tìm một con đường mới, hay ở lại với PHP...\n\nTôi tâm sự với người anh, người thầy của mình #Robowonder, và tâm trạng tôi càng rối bời hơn vì thầy nói: \"Con đường là do em chọn, anh cũng chỉ chia sẽ được những gì có thể\", một điều nữa là tôi đã có thể thực tập ở nơi mà thầy tìm cho nhưng tôi đã chọn vào {Be} cùng những người bạn của mình cũng như lúc đó tôi không dám chắc rằng điều đó thực sự tốt?.\n\nMở bài hát Cavana của Camila Cabello, tôi không hề hối hận quyết định của mình tôi chỉ đang cảm thấy buồn chán vì đến bây giờ tôi học, tôi làm, tôi biết chưa đủ nhiều về javascript,... Sau khi tâm sự đôi lời tôi được biết hiện tại NodeJS đang rất hot, được sử dụng nhiều nhưng đa số chưa tiếp cận được, ngay cả cty của thầy tôi cũng chưa làm về nó, họ chỉ sử dụng PHP và Laravel là chính vậy tại sao tôi lại buồn? Tôi nhận ra môi trường làm việc của thầy tôi cũng như ở {Be}...những giai điệu vui tai của Havana làm tâm trạng tôi nhẹ trở lại, và tôi biết rằng tôi không nên ở lại {Be} chỉ vì trả ơn training thẩm chí việc rời đi sau khi training theo thầy tôi nói rất là bình thường, mà lúc này tôi muốn ở lại {Be} để làm vì một mặt tôi có thể thực hiện ước mơ của mình là học hỏi bằng cách tham gia vào những dự án javascript mặt khác tôi có đủ tài chính để tự lo cho bản thân, sau 1 năm, 2 năm,.. dám chắc tôi sẽ có thể đứng vững trên đôi chân của mình.\n\nLúc đó tôi có thể đi những nơi tôi muốn, làm việc những nơi tôi xem là thú vị hơn, và điều quan trọng là khi làm việc ở đó tôi cảm nhận được tôi thật sử yêu công việc mình đang làm.\n"},"__N_SSG":true}